# Part 3

### Normalizing Genres

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import database_exists, create_database
from urllib.parse import quote_plus as urlquote
import json
df = pd.read_csv('Data/title_basics_filtered.csv.gz')
df.head(2)

# Load data from CSV files
basics = pd.read_csv('Data/title_basics_filtered.csv.gz', compression='gzip')
ratings = pd.read_csv('Data/ratings_filtered.csv.gz', compression='gzip')
# Load data from JSON files
tmdb_data = pd.concat([pd.read_json('Data/tmdb_api_results_2000.json'), pd.read_json('Data/tmdb_api_results_2001.json')])

In [2]:
# Connect with the MySQL server
with open('/Users/cjhun/.secret/mysql.json') as f:
    login = json.load(f)

# Create a database connection
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/Movies"
engine = create_engine(connection)

# Check if the database exists; if not, create it
if not database_exists(connection):
    create_database(connection)
    print('Database created!')

In [3]:
df = df.drop(columns=['originalTitle', 'isAdult', 'titleType'])

In [4]:
## create a col with a list of genres
df['genres_split'] = df['genres'].str.split(',')
df

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70,Drama,[Drama]
2,tt0068865,Lives of Performers,2016.0,NaN,90,Drama,[Drama]
3,tt0069049,The Other Side of the Wind,2018.0,NaN,122,Drama,[Drama]
4,tt0088751,The Naked Monster,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...
81884,tt9914942,Life Without Sara Amat,2019.0,NaN,74,Drama,[Drama]
81885,tt9915872,The Last White Witch,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81886,tt9916170,The Rehearsal,2019.0,NaN,51,Drama,[Drama]
81887,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81888,tt9916362,Coven,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [5]:
# Create a col with a list of genres
genres_split = df['genres'].str.split(',')

# Using explode to separate the list of genres into new rows
exploded_genres = df.explode('genres_split')
exploded_genres

# getting the unique genres from the genres_split column and sort alphabetically
unique_genres = genres_split.explode().unique()
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [6]:
# Creating a new title_genres table (only want 'tconst' and 'genres_split' columns)
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [7]:
# Making the genre mapper dictionary to replace string genres with integers
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))

In [8]:
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))

In [9]:
# Define a function to map genre lists to genre IDs
def map_genre_list(genre_list):
    return [genre_map.get(item, -1) for item in genre_list]

# Apply the custom function to the 'genres_split' column
df['genre_id'] = df['genres_split'].apply(map_genre_list)

# Drop the 'genres_split' column
df = df.drop(columns='genres_split')

In [10]:
# genre lookup table
genre_lookup = pd.DataFrame({'Genre_Name': genre_id_map.keys(),
                            'Genre_ID': genre_id_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [11]:
# Removing the first row from the df
tmdb_data = tmdb_data.iloc[1:]

# Resetting the index
tmdb_data.reset_index(drop=True, inplace=True)

In [12]:
# selecting the columns we want
movie_cols = ['imdb_id', 'revenue', 'budget', 'certification']
tmdb_data = tmdb_data[movie_cols]

In [13]:
tmdb_data.head()

     imdb_id     revenue      budget certification
0  tt0113026         0.0  10000000.0
1  tt0113092         0.0         0.0
2  tt0116391         0.0         0.0           NaN
3  tt0118694  14204632.0    150000.0            PG
4  tt0118852         0.0         0.0             R

In [14]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0035423            6.4     87361
1  tt0062336            6.4       179
2  tt0068865            5.4        75
3  tt0069049            6.7      7799
4  tt0088751            5.2       339

### Saving the MySQL tables with tconst as the primary key

1. Creating a datatype schema for to_sql
   - Check the dtypes of your DataFrame: (df.dtypes)
       - create a dictionary with each column name as a key and the corresponding SQL datatype as the value
   - Find the corresponding SQLalchemy datatype to use in the table
   
   - Note on the string columns:
       - for columns with 'object' dtype, you should use:
           - the string type if the column will become your primary key
           - otherwise, use the text data type
           - Both String/Text will need the maximum string length to use for that column

In [15]:
## get max string length
max_str_len = df['tconst'].fillna('').map(len).max()
max_str_len

10

In [16]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = df['tconst'].fillna('').map(len).max()
title_len = df['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [17]:
# saving tmdb data to sql
tmdb_data.to_sql('tmdb_data', engine, dtype=df_schema, if_exists='replace', index=False)

2596

In [18]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

81889

In [19]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('genres',engine,dtype=df_schema,if_exists='replace',index=False)

25

In [20]:
ratings.to_sql('title_ratings', engine, dtype=df_schema, if_exists='replace', index=False)

68046

In [21]:
# saving genres to sql
title_genres.to_sql('title_genres', engine, dtype=df_schema, if_exists='replace', index=False)

153594

In [22]:
# show all tables in sql
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

In [23]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')